<script lang="ts">
	import type { ShortArticlePreview } from '$lib/entities/article/model/short-article-preview';
	import { ArticleList } from '$lib/widgets/article-list';
	import type { PageData } from './$types';

	export let data: PageData;

	// const articlePreviews: ShortArticlePreview[] = [
	// 	{
	// 		title:
	// 			'Почему не стоит использовать FSD вместе с Svelte или как я написал сайт блог и пожалел',
	// 		createdAt: '2024-05-18T13:42:08.225Z',
	// 		likeCount: 10,
	// 		slug: '1',
	// 		previewText:
	// 			'В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке. В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке'
	// 	},
	// 	{
	// 		title: 'Почему не стоит использовать FSD вместе с Svelte',
	// 		createdAt: '2024-05-18T13:42:08.225Z',
	// 		likeCount: 10,
	// 		slug: '2',
	// 		previewText:
	// 			'В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке. В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке'
	// 	},
	// 	{
	// 		title: 'Почему не стоит использовать FSD вместе с Svelte',
	// 		createdAt: '2024-05-18T13:42:08.225Z',
	// 		likeCount: 10,
	// 		slug: '3',
	// 		previewText:
	// 			'В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке. В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке'
	// 	},
	// 	{
	// 		title: 'Почему не стоит использовать FSD вместе с Svelte',
	// 		createdAt: '2024-05-18T13:42:08.225Z',
	// 		likeCount: 10,
	// 		slug: '4',
	// 		previewText:
	// 			'В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке. В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке'
	// 	},
	// 	{
	// 		title: 'Почему не стоит использовать FSD вместе с Svelte',
	// 		createdAt: '2024-05-18T13:42:08.225Z',
	// 		likeCount: 10,
	// 		slug: '5',
	// 		previewText:
	// 			'В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке. В начале мы все хотим бежать в переди паровоза потому что я не до конца понимаю, а в чем основной смысл то? Мы когда играем мы же хотим большую рыбу? больше читай у меня в блоке'
	// 	}
	// ];
</script>

<main>
	<ArticleList articlePreviews={data.articles} />
</main>
